test/tests/input_errors/foam_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          42;
        startFace       1569;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          420;
        startFace       1611;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       2031;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       2121;
    }
)

// ************************************************************************* //
